app/controllers/inputs_controller.rb

UPDATE "inputs" SET "updated_at" = '2012-07-12 20:28:45.265254', "active" = 't' WHERE "inputs"."id" = 37
---
  def start
  @input.update_attributes(:updated_at => (Time.now - @input.interval.hours.to_i), :active=>true)

UPDATE "inputs" SET "active" = 'f', "updated_at" = '2012-07-12 21:28:40.865274' WHERE "inputs"."id" = 37
---
  def stop
  @input.update_attributes(:active=>false)

UPDATE "inputs" SET "start_date" = '09/15/2012,09/18/2012,09/21/2012,09/24/2012', "return_date" = '11/30/2012,12/02/2012,12/05/2012,12/08/2012,12/11/2012', "updated_at" = '2012-07-12 21:28:18.950473' WHERE "inputs"."id" = 37
---
  def update
    #@input = Input.find(params[:id])

    respond_to do |format|
      if @input.update_attributes(params[:input])